# OLDGetHangingPos

## Description
Returns handle of the Hanging Position where the specified load is attached.

```pascal
FUNCTION OLDGetHangingPos(
				handle    : HANDLE;
				loadIndex : INTEGER): HANDLE;
```

```python
def vs.OLDGetHangingPos(handle, loadIndex):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|   |
|loadIndex|INTEGER|   |

## Version
Availability: from Vectorworks 2019

## Category
* Truss Analysis